susanw1/zscript/receivers/generic-c++/zll/arm/implementations/src/main/c++/stm32/AlternateFunction/STM32L051.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2022-12-19T23:52:17.195131
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define COMP1_OUT_PA0_ PA0,GPIO_AF7
#define COMP1_OUT_PA11_ PA11,GPIO_AF7
#define COMP1_OUT_PA6_ PA6,GPIO_AF7
#define _COMP1_OUT_PA0_ 1
#define _COMP1_OUT_PA11_ 1
#define _COMP1_OUT_PA6_ 1

#define COMP2_OUT_PA12_ PA12,GPIO_AF7
#define COMP2_OUT_PA2_ PA2,GPIO_AF7
#define COMP2_OUT_PA7_ PA7,GPIO_AF7
#define _COMP2_OUT_PA12_ 1
#define _COMP2_OUT_PA2_ 1
#define _COMP2_OUT_PA7_ 1

#define CRS_SYNC_PA8_ PA8,GPIO_AF2
#define CRS_SYNC_PH0_ PH0,GPIO_AF0
#define _CRS_SYNC_PA8_ 1
#define _CRS_SYNC_PH0_ 1

#define EVENTOUT_PA1_ PA1,GPIO_AF0
#define EVENTOUT_PA11_ PA11,GPIO_AF2
#define EVENTOUT_PA12_ PA12,GPIO_AF2
#define EVENTOUT_PA15_ PA15,GPIO_AF3
#define EVENTOUT_PA6_ PA6,GPIO_AF6
#define EVENTOUT_PA7_ PA7,GPIO_AF6
#define EVENTOUT_PA8_ PA8,GPIO_AF3
#define EVENTOUT_PB0_ PB0,GPIO_AF0
#define EVENTOUT_PB11_ PB11,GPIO_AF0
#define EVENTOUT_PB12_ PB12,GPIO_AF6
#define EVENTOUT_PB3_ PB3,GPIO_AF4
#define EVENTOUT_PB4_ PB4,GPIO_AF2
#define EVENTOUT_PB9_ PB9,GPIO_AF2
#define EVENTOUT_PC0_ PC0,GPIO_AF2
#define EVENTOUT_PC1_ PC1,GPIO_AF2
#define EVENTOUT_PC4_ PC4,GPIO_AF0
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA11_ 1
#define _EVENTOUT_PA12_ 1
#define _EVENTOUT_PA15_ 1
#define _EVENTOUT_PA6_ 1
#define _EVENTOUT_PA7_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PB0_ 1
#define _EVENTOUT_PB11_ 1
#define _EVENTOUT_PB12_ 1
#define _EVENTOUT_PB3_ 1
#define _EVENTOUT_PB4_ 1
#define _EVENTOUT_PB9_ 1
#define _EVENTOUT_PC0_ 1
#define _EVENTOUT_PC1_ 1
#define _EVENTOUT_PC4_ 1

#define I2C1_SCL_PB6_ PB6,GPIO_AF1
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PB7_ PB7,GPIO_AF1
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF3
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF6
#define I2C2_SCL_PB13_ PB13,GPIO_AF5
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PB13_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF6
#define I2C2_SDA_PB14_ PB14,GPIO_AF5
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PB14_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF5
#define _I2C2_SMBA_PB12_ 1

#define I2S2_CK_PB13_ PB13,GPIO_AF0
#define _I2S2_CK_PB13_ 1

#define I2S2_MCK_PB14_ PB14,GPIO_AF0
#define I2S2_MCK_PC2_ PC2,GPIO_AF2
#define _I2S2_MCK_PB14_ 1
#define _I2S2_MCK_PC2_ 1

#define I2S2_SD_PB15_ PB15,GPIO_AF0
#define I2S2_SD_PC3_ PC3,GPIO_AF2
#define _I2S2_SD_PB15_ 1
#define _I2S2_SD_PC3_ 1

#define I2S2_WS_PB12_ PB12,GPIO_AF0
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PB9_ 1

#define LCD_COM0_PA8_ PA8,GPIO_AF1
#define _LCD_COM0_PA8_ 1

#define LCD_COM1_PA9_ PA9,GPIO_AF1
#define _LCD_COM1_PA9_ 1

#define LCD_COM2_PA10_ PA10,GPIO_AF1
#define _LCD_COM2_PA10_ 1

#define LCD_COM3_PB9_ PB9,GPIO_AF1
#define _LCD_COM3_PB9_ 1

#define LCD_COM4_PC10_ PC10,GPIO_AF1
#define _LCD_COM4_PC10_ 1

#define LCD_COM5_PC11_ PC11,GPIO_AF1
#define _LCD_COM5_PC11_ 1

#define LCD_COM6_PC12_ PC12,GPIO_AF1
#define _LCD_COM6_PC12_ 1

#define LCD_COM7_PD2_ PD2,GPIO_AF1
#define _LCD_COM7_PD2_ 1

#define LCD_SEG0_PA1_ PA1,GPIO_AF1
#define _LCD_SEG0_PA1_ 1

#define LCD_SEG1_PA2_ PA2,GPIO_AF1
#define _LCD_SEG1_PA2_ 1

#define LCD_SEG10_PB10_ PB10,GPIO_AF1
#define _LCD_SEG10_PB10_ 1

#define LCD_SEG11_PB11_ PB11,GPIO_AF1
#define _LCD_SEG11_PB11_ 1

#define LCD_SEG12_PB12_ PB12,GPIO_AF1
#define _LCD_SEG12_PB12_ 1

#define LCD_SEG13_PB13_ PB13,GPIO_AF1
#define _LCD_SEG13_PB13_ 1

#define LCD_SEG14_PB14_ PB14,GPIO_AF1
#define _LCD_SEG14_PB14_ 1

#define LCD_SEG15_PB15_ PB15,GPIO_AF1
#define _LCD_SEG15_PB15_ 1

#define LCD_SEG16_PB8_ PB8,GPIO_AF1
#define _LCD_SEG16_PB8_ 1

#define LCD_SEG17_PA15_ PA15,GPIO_AF1
#define _LCD_SEG17_PA15_ 1

#define LCD_SEG18_PC0_ PC0,GPIO_AF1
#define _LCD_SEG18_PC0_ 1

#define LCD_SEG19_PC1_ PC1,GPIO_AF1
#define _LCD_SEG19_PC1_ 1

#define LCD_SEG2_PA3_ PA3,GPIO_AF1
#define _LCD_SEG2_PA3_ 1

#define LCD_SEG20_PC2_ PC2,GPIO_AF1
#define _LCD_SEG20_PC2_ 1

#define LCD_SEG21_PC3_ PC3,GPIO_AF1
#define _LCD_SEG21_PC3_ 1

#define LCD_SEG22_PC4_ PC4,GPIO_AF1
#define _LCD_SEG22_PC4_ 1

#define LCD_SEG23_PC5_ PC5,GPIO_AF1
#define _LCD_SEG23_PC5_ 1

#define LCD_SEG24_PC6_ PC6,GPIO_AF1
#define _LCD_SEG24_PC6_ 1

#define LCD_SEG25_PC7_ PC7,GPIO_AF1
#define _LCD_SEG25_PC7_ 1

#define LCD_SEG26_PC8_ PC8,GPIO_AF1
#define _LCD_SEG26_PC8_ 1

#define LCD_SEG27_PC9_ PC9,GPIO_AF1
#define _LCD_SEG27_PC9_ 1

#define LCD_SEG28_PC10_ PC10,GPIO_AF1
#define _LCD_SEG28_PC10_ 1

#define LCD_SEG29_PC11_ PC11,GPIO_AF1
#define _LCD_SEG29_PC11_ 1

#define LCD_SEG3_PA6_ PA6,GPIO_AF1
#define _LCD_SEG3_PA6_ 1

#define LCD_SEG30_PC12_ PC12,GPIO_AF1
#define _LCD_SEG30_PC12_ 1

#define LCD_SEG31_PD2_ PD2,GPIO_AF1
#define _LCD_SEG31_PD2_ 1

#define LCD_SEG4_PA7_ PA7,GPIO_AF1
#define _LCD_SEG4_PA7_ 1

#define LCD_SEG40_PC10_ PC10,GPIO_AF1
#define _LCD_SEG40_PC10_ 1

#define LCD_SEG41_PC11_ PC11,GPIO_AF1
#define _LCD_SEG41_PC11_ 1

#define LCD_SEG42_PC12_ PC12,GPIO_AF1
#define _LCD_SEG42_PC12_ 1

#define LCD_SEG43_PD2_ PD2,GPIO_AF1
#define _LCD_SEG43_PD2_ 1

#define LCD_SEG5_PB0_ PB0,GPIO_AF1
#define _LCD_SEG5_PB0_ 1

#define LCD_SEG6_PB1_ PB1,GPIO_AF1
#define _LCD_SEG6_PB1_ 1

#define LCD_SEG7_PB3_ PB3,GPIO_AF1
#define _LCD_SEG7_PB3_ 1

#define LCD_SEG8_PB4_ PB4,GPIO_AF1
#define _LCD_SEG8_PB4_ 1

#define LCD_SEG9_PB5_ PB5,GPIO_AF1
#define _LCD_SEG9_PB5_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF2
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF0
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF2
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF0
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF2
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF0
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1

#define LPTIM1_OUT_PB2_ PB2,GPIO_AF2
#define LPTIM1_OUT_PC1_ PC1,GPIO_AF0
#define _LPTIM1_OUT_PB2_ 1
#define _LPTIM1_OUT_PC1_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF4
#define LPUART1_CTS_PB13_ PB13,GPIO_AF4
#define _LPUART1_CTS_PA6_ 1
#define _LPUART1_CTS_PB13_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF4
#define LPUART1_DE_PB12_ PB12,GPIO_AF2
#define LPUART1_DE_PB14_ PB14,GPIO_AF4
#define LPUART1_DE_PD2_ PD2,GPIO_AF0
#define _LPUART1_DE_PB1_ 1
#define _LPUART1_DE_PB12_ 1
#define _LPUART1_DE_PB14_ 1
#define _LPUART1_DE_PD2_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF4
#define LPUART1_RTS_PB12_ PB12,GPIO_AF2
#define LPUART1_RTS_PB14_ PB14,GPIO_AF4
#define LPUART1_RTS_PD2_ PD2,GPIO_AF0
#define _LPUART1_RTS_PB1_ 1
#define _LPUART1_RTS_PB12_ 1
#define _LPUART1_RTS_PB14_ 1
#define _LPUART1_RTS_PD2_ 1

#define LPUART1_RX_PB11_ PB11,GPIO_AF4
#define LPUART1_RX_PC11_ PC11,GPIO_AF0
#define LPUART1_RX_PC5_ PC5,GPIO_AF2
#define _LPUART1_RX_PB11_ 1
#define _LPUART1_RX_PC11_ 1
#define _LPUART1_RX_PC5_ 1

#define LPUART1_TX_PB10_ PB10,GPIO_AF4
#define LPUART1_TX_PC10_ PC10,GPIO_AF0
#define LPUART1_TX_PC4_ PC4,GPIO_AF2
#define _LPUART1_TX_PB10_ 1
#define _LPUART1_TX_PC10_ 1
#define _LPUART1_TX_PC4_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define RCC_MCO_PA9_ PA9,GPIO_AF0
#define _RCC_MCO_PA8_ 1
#define _RCC_MCO_PA9_ 1

#define RTC_OUT_ALARM_PB14_ PB14,GPIO_AF2
#define _RTC_OUT_ALARM_PB14_ 1

#define RTC_OUT_CALIB_PB14_ PB14,GPIO_AF2
#define _RTC_OUT_CALIB_PB14_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF2
#define _RTC_REFIN_PB15_ 1

#define SPI1_MISO_PA11_ PA11,GPIO_AF0
#define SPI1_MISO_PA6_ PA6,GPIO_AF0
#define SPI1_MISO_PB4_ PB4,GPIO_AF0
#define _SPI1_MISO_PA11_ 1
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1

#define SPI1_MOSI_PA12_ PA12,GPIO_AF0
#define SPI1_MOSI_PA7_ PA7,GPIO_AF0
#define SPI1_MOSI_PB5_ PB5,GPIO_AF0
#define _SPI1_MOSI_PA12_ 1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF0
#define SPI1_NSS_PA4_ PA4,GPIO_AF0
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF0
#define SPI1_SCK_PB3_ PB3,GPIO_AF0
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF0
#define SPI2_MISO_PC2_ PC2,GPIO_AF2
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF0
#define SPI2_MOSI_PC3_ PC3,GPIO_AF2
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC3_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF0
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1

#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF0
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1

#define SYS_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_SWCLK_PA14_ 1

#define SYS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_SWDIO_PA13_ 1

#define TIM21_CH1_PA2_ PA2,GPIO_AF0
#define TIM21_CH1_PB13_ PB13,GPIO_AF6
#define _TIM21_CH1_PA2_ 1
#define _TIM21_CH1_PB13_ 1

#define TIM21_CH2_PA3_ PA3,GPIO_AF0
#define TIM21_CH2_PB14_ PB14,GPIO_AF6
#define _TIM21_CH2_PA3_ 1
#define _TIM21_CH2_PB14_ 1

#define TIM21_ETR_PA1_ PA1,GPIO_AF5
#define TIM21_ETR_PC9_ PC9,GPIO_AF0
#define _TIM21_ETR_PA1_ 1
#define _TIM21_ETR_PC9_ 1

#define TIM22_CH1_PA6_ PA6,GPIO_AF5
#define TIM22_CH1_PB4_ PB4,GPIO_AF4
#define TIM22_CH1_PC6_ PC6,GPIO_AF0
#define _TIM22_CH1_PA6_ 1
#define _TIM22_CH1_PB4_ 1
#define _TIM22_CH1_PC6_ 1

#define TIM22_CH2_PA7_ PA7,GPIO_AF5
#define TIM22_CH2_PB5_ PB5,GPIO_AF4
#define TIM22_CH2_PC7_ PC7,GPIO_AF0
#define _TIM22_CH2_PA7_ 1
#define _TIM22_CH2_PB5_ 1
#define _TIM22_CH2_PC7_ 1

#define TIM22_ETR_PA4_ PA4,GPIO_AF5
#define TIM22_ETR_PC8_ PC8,GPIO_AF0
#define _TIM22_ETR_PA4_ 1
#define _TIM22_ETR_PC8_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF2
#define TIM2_CH1_PA15_ PA15,GPIO_AF5
#define TIM2_CH1_PA5_ PA5,GPIO_AF5
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF2
#define TIM2_CH2_PB3_ PB3,GPIO_AF2
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF2
#define TIM2_CH3_PB10_ PB10,GPIO_AF2
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF2
#define TIM2_CH4_PB11_ PB11,GPIO_AF2
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF5
#define TIM2_ETR_PA15_ PA15,GPIO_AF2
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1

#define TSC_G1_IO1_PA0_ PA0,GPIO_AF3
#define _TSC_G1_IO1_PA0_ 1

#define TSC_G1_IO2_PA1_ PA1,GPIO_AF3
#define _TSC_G1_IO2_PA1_ 1

#define TSC_G1_IO3_PA2_ PA2,GPIO_AF3
#define _TSC_G1_IO3_PA2_ 1

#define TSC_G1_IO4_PA3_ PA3,GPIO_AF3
#define _TSC_G1_IO4_PA3_ 1

#define TSC_G2_IO1_PA4_ PA4,GPIO_AF3
#define _TSC_G2_IO1_PA4_ 1

#define TSC_G2_IO2_PA5_ PA5,GPIO_AF3
#define _TSC_G2_IO2_PA5_ 1

#define TSC_G2_IO3_PA6_ PA6,GPIO_AF3
#define _TSC_G2_IO3_PA6_ 1

#define TSC_G2_IO4_PA7_ PA7,GPIO_AF3
#define _TSC_G2_IO4_PA7_ 1

#define TSC_G3_IO1_PC5_ PC5,GPIO_AF3
#define _TSC_G3_IO1_PC5_ 1

#define TSC_G3_IO2_PB0_ PB0,GPIO_AF3
#define _TSC_G3_IO2_PB0_ 1

#define TSC_G3_IO3_PB1_ PB1,GPIO_AF3
#define _TSC_G3_IO3_PB1_ 1

#define TSC_G3_IO4_PB2_ PB2,GPIO_AF3
#define _TSC_G3_IO4_PB2_ 1

#define TSC_G4_IO1_PA9_ PA9,GPIO_AF3
#define _TSC_G4_IO1_PA9_ 1

#define TSC_G4_IO2_PA10_ PA10,GPIO_AF3
#define _TSC_G4_IO2_PA10_ 1

#define TSC_G4_IO3_PA11_ PA11,GPIO_AF3
#define _TSC_G4_IO3_PA11_ 1

#define TSC_G4_IO4_PA12_ PA12,GPIO_AF3
#define _TSC_G4_IO4_PA12_ 1

#define TSC_G5_IO1_PB3_ PB3,GPIO_AF3
#define _TSC_G5_IO1_PB3_ 1

#define TSC_G5_IO2_PB4_ PB4,GPIO_AF3
#define _TSC_G5_IO2_PB4_ 1

#define TSC_G5_IO3_PB6_ PB6,GPIO_AF3
#define _TSC_G5_IO3_PB6_ 1

#define TSC_G5_IO4_PB7_ PB7,GPIO_AF3
#define _TSC_G5_IO4_PB7_ 1

#define TSC_G6_IO1_PB11_ PB11,GPIO_AF3
#define _TSC_G6_IO1_PB11_ 1

#define TSC_G6_IO2_PB12_ PB12,GPIO_AF3
#define _TSC_G6_IO2_PB12_ 1

#define TSC_G6_IO3_PB13_ PB13,GPIO_AF3
#define _TSC_G6_IO3_PB13_ 1

#define TSC_G6_IO4_PB14_ PB14,GPIO_AF3
#define _TSC_G6_IO4_PB14_ 1

#define TSC_G7_IO1_PC0_ PC0,GPIO_AF3
#define _TSC_G7_IO1_PC0_ 1

#define TSC_G7_IO2_PC1_ PC1,GPIO_AF3
#define _TSC_G7_IO2_PC1_ 1

#define TSC_G7_IO3_PC2_ PC2,GPIO_AF3
#define _TSC_G7_IO3_PC2_ 1

#define TSC_G7_IO4_PC3_ PC3,GPIO_AF3
#define _TSC_G7_IO4_PC3_ 1

#define TSC_G8_IO1_PC6_ PC6,GPIO_AF3
#define _TSC_G8_IO1_PC6_ 1

#define TSC_G8_IO2_PC7_ PC7,GPIO_AF3
#define _TSC_G8_IO2_PC7_ 1

#define TSC_G8_IO3_PC8_ PC8,GPIO_AF3
#define _TSC_G8_IO3_PC8_ 1

#define TSC_G8_IO4_PC9_ PC9,GPIO_AF3
#define _TSC_G8_IO4_PC9_ 1

#define TSC_SYNC_PB10_ PB10,GPIO_AF3
#define TSC_SYNC_PB8_ PB8,GPIO_AF3
#define _TSC_SYNC_PB10_ 1
#define _TSC_SYNC_PB8_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF4
#define _UART1_CK_PA8_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF4
#define _UART1_CTS_PA11_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF4
#define _UART1_DE_PA12_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF4
#define _UART1_RTS_PA12_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF4
#define UART1_RX_PB7_ PB7,GPIO_AF0
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF4
#define UART1_TX_PB6_ PB6,GPIO_AF0
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF4
#define _UART2_CK_PA4_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF4
#define _UART2_CTS_PA0_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF4
#define _UART2_DE_PA1_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF4
#define _UART2_RTS_PA1_ 1

#define UART2_RX_PA15_ PA15,GPIO_AF4
#define UART2_RX_PA3_ PA3,GPIO_AF4
#define _UART2_RX_PA15_ 1
#define _UART2_RX_PA3_ 1

#define UART2_TX_PA14_ PA14,GPIO_AF4
#define UART2_TX_PA2_ PA2,GPIO_AF4
#define _UART2_TX_PA14_ 1
#define _UART2_TX_PA2_ 1

#define UART3_CTS_PA6_ PA6,GPIO_AF4
#define UART3_CTS_PB13_ PB13,GPIO_AF4
#define _UART3_CTS_PA6_ 1
#define _UART3_CTS_PB13_ 1

#define UART3_DE_PB1_ PB1,GPIO_AF4
#define UART3_DE_PB12_ PB12,GPIO_AF2
#define UART3_DE_PB14_ PB14,GPIO_AF4
#define UART3_DE_PD2_ PD2,GPIO_AF0
#define _UART3_DE_PB1_ 1
#define _UART3_DE_PB12_ 1
#define _UART3_DE_PB14_ 1
#define _UART3_DE_PD2_ 1

#define UART3_RTS_PB1_ PB1,GPIO_AF4
#define UART3_RTS_PB12_ PB12,GPIO_AF2
#define UART3_RTS_PB14_ PB14,GPIO_AF4
#define UART3_RTS_PD2_ PD2,GPIO_AF0
#define _UART3_RTS_PB1_ 1
#define _UART3_RTS_PB12_ 1
#define _UART3_RTS_PB14_ 1
#define _UART3_RTS_PD2_ 1

#define UART3_RX_PB11_ PB11,GPIO_AF4
#define UART3_RX_PC11_ PC11,GPIO_AF0
#define UART3_RX_PC5_ PC5,GPIO_AF2
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PC5_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF4
#define UART3_TX_PC10_ PC10,GPIO_AF0
#define UART3_TX_PC4_ PC4,GPIO_AF2
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PC4_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF4
#define _USART1_CK_PA8_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF4
#define _USART1_CTS_PA11_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF4
#define _USART1_DE_PA12_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF4
#define _USART1_RTS_PA12_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF4
#define USART1_RX_PB7_ PB7,GPIO_AF0
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF4
#define USART1_TX_PB6_ PB6,GPIO_AF0
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF4
#define _USART2_CK_PA4_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF4
#define _USART2_CTS_PA0_ 1

#define USART2_DE_PA1_ PA1,GPIO_AF4
#define _USART2_DE_PA1_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF4
#define _USART2_RTS_PA1_ 1

#define USART2_RX_PA15_ PA15,GPIO_AF4
#define USART2_RX_PA3_ PA3,GPIO_AF4
#define _USART2_RX_PA15_ 1
#define _USART2_RX_PA3_ 1

#define USART2_TX_PA14_ PA14,GPIO_AF4
#define USART2_TX_PA2_ PA2,GPIO_AF4
#define _USART2_TX_PA14_ 1
#define _USART2_TX_PA2_ 1

#define USB_NOE_PA13_ PA13,GPIO_AF2
#define USB_NOE_PC9_ PC9,GPIO_AF2
#define _USB_NOE_PA13_ 1
#define _USB_NOE_PC9_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */